In [1]:
import numpy as np

In [2]:
import pandas as pd

In [29]:
first_series = pd.Series([40,50,56,48],index=['a','b','e','f'],dtype=int)

In [22]:
first_series.astype(int)

a    40
b    50
e    56
f    48
dtype: int32

In [5]:
Countries_with_GDP = pd.Series([2255.225482,629.9553062,11601.63022,25306.82494,27266.40335,19466.99052,588.3691778,2890.345675,24733.62696,1445.760002,4803.398244,2618.876037,590.4521124,665.7982328,7122.938458,2639.54156,3362.4656,15378.16704,30860.12808,2579.115607,6525.541272,229.6769525,2242.689259,27570.4852,23016.84778,1334.646773,402.6953275,6047.200797,394.1156638,385.5793827,1414.072488,5745.981529,837.7464011,1206.991065,27715.52837,18937.24998,39578.07441,478.2194906,16684.21278,279.2204061,5345.213415,6288.25324,1908.304416,274.8728621,14646.42094,40034.85063,672.1547506,3359.517402,36152.66676,3054.727742,33529.83052,3825.093781,15428.32098,33630.24604,39170.41371,2699.123242,21058.43643,28272.40661,37691.02733,9581.05659,5671.912202,757.4009286,347.7456605
],index=['Algeria','Angola','Argentina','Australia','Austria','Bahamas','Bangladesh','Belarus','Belgium','Bhutan','Brazil','Bulgaria','Cambodia','Cameroon','Chile','China','Colombia','Cyprus','Denmark','El Salvador','Estonia','Ethiopia','Fiji','Finland','France','Georgia','Ghana','Grenada','Guinea','Haiti','Honduras','Hungary','India','Indonesia','Ireland','Italy','Japan','Kenya', 'South Korea','Liberia','Malaysia','Mexico', 'Morocco','Nepal','New Zealand','Norway','Pakistan', 'Peru','Qatar','Russia','Singapore','South Africa','Spain','Sweden','Switzerland','Thailand', 'United Arab Emirates','United Kingdom','United States','Uruguay','Venezuela','Vietnam','Zimbabwe'
])

In [6]:
Countries_with_GDP

Algeria           2255.225482
Angola             629.955306
Argentina        11601.630220
Australia        25306.824940
Austria          27266.403350
                     ...
United States    37691.027330
Uruguay           9581.056590
Venezuela         5671.912202
Vietnam            757.400929
Zimbabwe           347.745660
Length: 63, dtype: float64

In [7]:
#Accessing Elements DF

In [8]:
Countries_with_GDP['Angola']

629.9553062

In [9]:
Countries_with_GDP[0]

2255.225482

In [10]:
Countries_with_GDP[0:6]

Algeria       2255.225482
Angola         629.955306
Argentina    11601.630220
Australia    25306.824940
Austria      27266.403350
Bahamas      19466.990520
dtype: float64

In [12]:
Countries_with_GDP[0:11].max()

27266.40335

In [13]:
Countries_with_GDP[0:11].std()

11035.417236991441

In [14]:
Countries_with_GDP.iloc[0]

2255.225482

In [27]:
second_vector_series = pd.Series([10,20,30,40],index=['a','b','c','d'],dtype=int)

In [32]:
(first_series+second_vector_series)

a    50.0
b    70.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [37]:
#using Dictionaries

Olympics_data = {'HostCity':['Japan','US','India','UK'],'Year':[2012,2013,2014,2015],'No. of Participations from Countries':[205,208,230,300]}

In [38]:
Olympics_data

{'HostCity': ['Japan', 'US', 'India', 'UK'],
 'Year': [2012, 2013, 2014, 2015],
 'No. of Participations from Countries': [205, 208, 230, 300]}

In [39]:
df_olynpic_data = pd.DataFrame(Olympics_data)

In [40]:
df_olynpic_data

  HostCity  Year  No. of Participations from Countries
0    Japan  2012                                   205
1       US  2013                                   208
2    India  2014                                   230
3       UK  2015                                   300

In [41]:
olympic_data_dict = {'Japan':{2012:205},'India':{2014:230}}

In [42]:
df_olynpic_data_dict = pd.DataFrame(olympic_data_dict)

In [43]:
df_olynpic_data_dict

      Japan  India
2012  205.0    NaN
2014    NaN  230.0

In [47]:
df_olynpic_data_dict

      Japan  India
2012  205.0    NaN
2014    NaN  230.0

In [48]:
np_array = np.array([2015,2016,2017,2018])

In [49]:
dict1 = {'Year':np_array}

In [50]:
dict1

{'Year': array([2015, 2016, 2017, 2018])}

In [51]:
pd_dict1 = pd.DataFrame(dict1)

In [52]:
pd_dict1

   Year
0  2015
1  2016
2  2017
3  2018

View and Select data

In [53]:
oly_series_participation = pd.Series([201,203,240,205],index=[2012,2013,2014,2015])

In [54]:
oly_series_countries = pd.Series(['London','France','India','US'],index=[2012,2013,2014,2015])

In [55]:
df_oly = pd.DataFrame({'No. of Participating Countires':oly_series_participation,'Countries':oly_series_countries})

      No. of Participating Countires Countries
2012                             201    London
2013                             203    France
2014                             240     India
2015                             205        US

In [57]:
df_oly.describe

<bound method NDFrame.describe of       No. of Participating Countires Countries
2012                             201    London
2013                             203    France
2014                             240     India
2015                             205        US>

In [59]:
df_oly.head(2)
df_oly.tail(2)

      No. of Participating Countires Countries
2014                             240     India
2015                             205        US

In [60]:
df_oly.index

Int64Index([2012, 2013, 2014, 2015], dtype='int64')

In [61]:
df_oly['Countries']

2012    London
2013    France
2014     India
2015        US
Name: Countries, dtype: object

In [62]:
df_oly['No. of Participating Countires']

2012    201
2013    203
2014    240
2015    205
Name: No. of Participating Countires, dtype: int64

In [64]:
df_oly.iloc[2:3]

      No. of Participating Countires Countries
2014                             240     India

In [67]:
df_oly.iat[3,0] #[ROw,Col]

205

In [68]:
Sum = first_series+second_vector_series

In [69]:
Sum

a    50.0
b    70.0
c     NaN
d     NaN
e     NaN
f     NaN
dtype: float64

In [70]:
#drop NaN values from data set

dropna_Sum = Sum.dropna()

In [72]:
Sum
dropna_Sum

a    50.0
b    70.0
dtype: float64

In [73]:
fillna_Sum = Sum.fillna(3)

In [74]:
fillna_Sum

a    50.0
b    70.0
c     3.0
d     3.0
e     3.0
f     3.0
dtype: float64

In [75]:
first_series

a    40
b    50
e    56
f    48
dtype: int32

In [76]:
fill_NaN_values_zeros = first_series.add(second_vector_series,fill_value=0)

In [77]:
fill_NaN_values_zeros

a    50.0
b    70.0
c    30.0
d    40.0
e    56.0
f    48.0
dtype: float64